lelebrr/Esp32-S3/src/core/main_menu.h
#ifndef __MAIN_MENU_H__
#define __MAIN_MENU_H__

#include <MenuItemInterface.h>

#include "menu_items/BleMenu.h"
#include "menu_items/ClockMenu.h"
#include "menu_items/ConfigMenu.h"
#include "menu_items/ConnectMenu.h"
#include "menu_items/ConsoleMenu.h"
#include "menu_items/EthernetMenu.h"
#include "menu_items/FaultInjectionMenu.h"
#include "menu_items/IoTMenu.h"
#include "menu_items/FMMenu.h"
#include "menu_items/FaultInjectionMenu.h"
#include "menu_items/FileMenu.h"
#include "menu_items/GpsMenu.h"
#include "menu_items/HardwareMenu.h"
#include "menu_items/IRMenu.h"
#include "menu_items/LightingMenu.h"
#include "menu_items/NRF24.h"
#include "menu_items/OthersMenu.h"
#include "menu_items/RFIDMenu.h"
#include "menu_items/RFMenu.h"
#include "menu_items/ScriptsMenu.h"
#include "menu_items/UsbMenu.h"
#include "menu_items/WifiMenu.h"

class MainMenu {
public:
    FileMenu fileMenu;
    BleMenu bleMenu;
    ClockMenu clockMenu;
    ConnectMenu connectMenu;
    ConfigMenu configMenu;
    ConsoleMenu consoleMenu;
    IoTMenu iotMenu;
    FMMenu fmMenu;
    GpsMenu gpsMenu;
    IRMenu irMenu;
    LightingMenu lightingMenu;
    NRF24Menu nrf24Menu;
    OthersMenu othersMenu;
    RFIDMenu rfidMenu;
    RFMenu rfMenu;
    ScriptsMenu scriptsMenu;
    WifiMenu wifiMenu;
    UsbMenu usbMenu;
    FaultInjectionMenu faultInjectionMenu;
    HardwareMenu hardwareMenu;
#if !defined(LITE_VERSION)
    EthernetMenu ethernetMenu;
#endif

    MainMenu();
    ~MainMenu();

    void begin(void);
    std::vector<MenuItemInterface *> getItems(void) { return _menuItems; }
    void hideAppsMenu();

private:
    int _currentIndex = 0;
    int _totalItems = 0;
    std::vector<MenuItemInterface *> _menuItems;
};
extern MainMenu mainMenu;

#endif
